OpenFOAM-3.0.1/chapter4/multiRegionHeater/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication splitMeshRegions -cellZones -overwrite

# remove fluid fields from solid regions (important for post-processing)
for i in heater surrondingSolid
do
   rm -f 0*/$i/{mut,alphat,epsilon,k,p,U,p_rgh}
done

## remove solid fields from fluid regions (important for post-processing)
for i in air
do
   rm -f 0*/$i/{Ypmma,Ychar}
done

for i in air surrondingSolid heater
do
   changeDictionary -region $i > log.changeDictionary.$i 2>&1
done


#-- Run on single processor
runApplication `getApplication`

## Decompose
#for i in bottomAir topAir heater leftSolid rightSolid
#do
#   decomposePar -region $i > log.decomposePar.$i 2>&1
#done
#
## Run
#runParallel `getApplication` 4
#
## Reconstruct
#for i in bottomAir topAir heater leftSolid rightSolid
#do
#   reconstructPar -region $i > log.reconstructPar.$i 2>&1
#done


echo
echo "creating files for paraview post-processing"
echo
paraFoam -touchAll

echo
echo "creating files for residual"
echo

foamLog log.chtMultiRegionSimpleFoam
# ----------------------------------------------------------------- end-of-file
